# Операторы сравнения — бинарные операторы, позволяющие сравнивать значения определённых типов данных, возвращая при этом чёткие ответы (True или False) на основе этих сравнений.
# True (Истина, логическое "да", 1) — положительный ответ 
# False (Ложь, логическое "нет", 0) — отрицательный ответ

# == (оператор равенства, возвращает True если значения полностью одинаковы, False — если значения отличаются)
number_1 = 4
number_2 = 5
print(number_1 == number_2)

number_1 = 4
number_2 = 4
print(number_1 == number_2)

print(type(number_1 == number_2))

number_1 = 4 # 100 в двоичной системе
number_2 = "4" # U+0032 в кодировке Unicode
print(number_1 == number_2)

number_1 = 4 # производится перевод в плавающую точку
number_2 = 4.0
print(number_1 == number_2)

number_1 = 4.1
number_2 = 4
print(number_1 == number_2)

string_1 = "привет"
string_2 = "Привет"
print(string_1 == string_2)

string_1 = "привет"
string_2 = "привет"
print(string_1 == string_2)

string_1 = "а"
string_2 = "a"
print(string_1 == string_2)

print("-" * 50)

# != (оператор неравенства, возвращает True если значения отличаются, False — если значения одинаковы)
number_1 = 4
number_2 = 5
print(number_1 != number_2)

number_1 = 4
number_2 = 4
print(number_1 != number_2)

string_1 = "привет"
string_2 = "Привет"
print(string_1 == string_2)

print("-" * 50)

# < (оператор "меньше, чем", возвращают True, если значение слева меньше, значения справа, False — в остальных случаях)
number_1 = 4
number_2 = 5
print(number_1 < number_2)

number_1 = 5
number_2 = 4
print(number_1 < number_2)

number_1 = 4
number_2 = 4
print(number_1 < number_2)

print("-" * 50)

# > (оператор "больше, чем", возвращают True, если значение слева больше, значения справа, False — в остальных случаях))
number_1 = 4
number_2 = 5
print(number_1 > number_2)

number_1 = 5
number_2 = 4
print(number_1 > number_2)

number_1 = 4
number_2 = 4
print(number_1 > number_2)

print("-" * 50)

# <= (оператор "меньше или равно", возвращают True, если значение слева меньше или равно значению справа, False — в ином случае)
number_1 = 4
number_2 = 5
print(number_1 <= number_2)

number_1 = 5
number_2 = 4
print(number_1 <= number_2)

number_1 = 4
number_2 = 4
print(number_1 <= number_2)

print("-" * 50)

# >= (оператор "больше или равно", возвращают True, если значение слева больше или равно значению справа, False — в ином случае)
number_1 = 4
number_2 = 5
print(number_1 >= number_2)

number_1 = 5
number_2 = 4
print(number_1 >= number_2)

number_1 = 4
number_2 = 4
print(number_1 >= number_2)

print("-" * 50)

string_1 = "щ"
string_2 = "z"
print(string_1 > string_2)

# Условная конструкция — конструкция, позволяющая выполнять различные блоки команд в зависимости от истинности некоторого условия (условного выражения). Представляет собой реализацию ветвления в программе.
# if (условный оператор, ключевое слово "если")

# Шаблон простейшей условной конструкции:
# if <условное выражение, возвращающее ответ True или False>:
#     [блок команд, выполяемых в случае, если ответ на условное выражение был True]
#     ...

age = int(input("Введите свой возраст:"))
if age < 18:
	print("Доступ закрыт! Несоответствие возрастному ограничению!")

# Пример реализации условной конструкции
number_1 = int(input("Введи первое число:"))
number_2 = int(input("Введи второе число:"))
if number_1 > number_2:
	print("Ого, какой ты непоследовательный! Ввел первое число, а оно больше второго!")
	print("Не думал, что ты так сделаешь!")

# print("Продолжаем дальше. Эта строка будет выведена в любом случае.")

# Пример реализации условной конструкции 2
a = int(input("Целое число: "))
if a > 0:
    a = a + 1  
print("Полученное число:", a)

# else (ключевое слово "иначе/в любом другом случае", выполняет блоки кода при ложном ответе выражения)

# Шаблон дополненной условной конструкции:
# if <условное выражение, возвращающее ответ True или False>:
#     [блок команд, выполяемых в случае, если ответ на условное выражение был True]
#     ...
# else:
#     [блок команд, выполяемых в случае, если ответ на условное выражение был False]

age = int(input("Введите свой возраст:"))
if age < 18:
	print("Доступ закрыт! Несоответствие возрастному ограничению!")
else:
	print("Доступ открыт!")

# Пример реализации дополненной условной конструкции
number_1 = int(input("Введи первое число:"))
number_2 = int(input("Введи второе число:"))
if number_1 > number_2:
	print("Ого, какой ты непоследовательный! Ввел первое число, а оно больше второго!")
	print("Не думал, что ты так сделаешь!")
else:
	print("Какой ты молодец!  Знаешь в каком порядке числа разложены!")
	print("Но ты такой предсказуемый ;)")

# print("Продолжаем дальше. Эта строка будет выведена в любом случае.")

# Пример реализации дополненной условной конструкции 2
number = int (input("Введите своё число:"))
if number > 0:
    number = number + 1
else:
    number = number - 2
print("Ваше число:", number)

# elif (ключевое слово "иначе, если", позволяет реализовать дополнительные проверки условной конструкции)
# Шаблон расширенной условной конструкции:
# if <условное выражение, возвращающее ответ True или False>:
#     [блок команд, выполяемых в случае, если ответ на условное выражение был True]
#     ...
# elif <новое условное выражение, возвращающее ответ True или Falsе, связанное с предыдущим>:
#     [блок команд, выполяемых в случае, если ответ на связанное условное выражение был True]
#     ...
# ...
# else:
#     [блок команд, выполяемых в случае, если ответ на условное выражение был False, необязателен]
#     ...
