# Урок 3. Переменные
# Переменная (variable) - ячейка памяти, имеющая своё собственное имя, способная хранить данные любого типа, предоставляющая возможность эти данные изменять (перезаписывать, удалять и т.п.). Переменная состоит из двух частей: имя и значение, разделённых между собой оператором присваивания (=).
# = (оператор присваивания)

# Правила наименования переменных:
# 1. Имя переменной должно состоять из букв (строчных или заглавных), цифр и знака нижнего подчёркивания.
# 2. Имя переменной не должно начинаться с цифры (с _ может)
# 3. Строчные и заглавные буквы воспринимаются отдельными символами, т.е. они неравнозначны (name и Name - разные переменные!)
# 4. Имя переменной не должно совпадать ни с одним из зарезервированных слов:
# 'False', 'None', 'True', 'and', 'as', 'assert', 'async', 'await', 'break', 'class', 'continue', 'def', 'del', 'elif', 'else', 'except', 'finally', 'for', 'from', 'global', 'if', 'import', 'in', 'is', 'lambda', 'nonlocal', 'not', 'or', 'pass', 'raise', 'return', 'try', 'while', 'with', 'yield'

# Примеры имён: name, Name, my_name, MY_NAME, name_12, Name13, _name, n12
# Примеры ошибочных имён: my name, 1name, 12, my-name, None

my_age = 28 # объявление (создание) переменной
print(my_age) # обращение к переменной
print("Мой возраст:", my_age)
print("В следующем году мне будет", my_age + 1) # 28 + 1
print("А в прошлом году мне было", my_age - 1) # 28 - 1

my_name = "Андрей" # объявление (создание) переменной
empty_variable = None
my_surname = "Вещев"

print("Меня зовут", my_name, my_surname, "и мне", my_age, "лет")

# Пример использования переменных
health = 100
enemy_damage = 20
health = health - enemy_damage # запись нового значения в существующую переменную
print("У вас осталось", health, "HP")
print(health)

# Обращение к несуществующей переменной
# enemy_health = enemy_health - damage

# Перезапись значения объявленной (существующей) переменной c учётом прошлого значения
age = 28
print("Мой возраст сейчас:", age)
age = age + 1 # 29
print("В следующем году мне будет:", age)
age = age - 2 # 27
print("А в прошлом году мне было:", age)

# Полная перезапись значения объявленной переменной 
my_status = "студент"
print("Раньше я был", my_status)
my_status = "преподаватель"
print("А теперь я", my_status)

# Задача на расчёт объема данных
# Один символ алфавита "весит" 4 бита. Сколько символов в этом алфавите? 
# N = 2 ** i
i = 4
N = 2 ** i
print("В алфавите", N, "символов")

# Сообщение, записанное буквами 64-символьного алфавита, содержит 20 символов. Какой объем информации оно несет?
# I = i * K
# i = log2N
K = 20
N = 64
i = 6
I = i * K
print("Объем информации в сообщении", I, "бит")

# Ввод данных в терминал
# input() - функция, позволяющая пользователю ввести данные в терминал, считать введённые данные из него и вернуть их обратно в программу. Может принимать подсказку для ввода в качестве аргумента. Данные возвращаются в программу в виде строки.

# Использование input() без аргумента-подсказки
# print("Напиши что-нибудь в терминале...")
# anything = input()
# print(anything, "...ты серьезно это написал?")

# Использование input() с аргументом-подсказкой
# something = input("Еще что-нибудь напиши!")
# print("Ну а теперь ты написал", something)

# Ошибка при использовании input()
# number = input("Напиши в консоль число, а я тебе его возведу в куб!\n")
# print("Ваше кубическое число:", number ** 3)

# Преобразование типов данных 
# Преобразование типов данных - перевод одного литерала типа данных в другой.
# type() - возвращает тип данных переданного в качестве аргумента значения
print(type(123))
print(type("Прикол"))
print(type(2.3))
print("-------------------------------")

number = "123"
# int() - функция, преобразующая переданные в качестве аргумента данные в целочисленный тип, если они состоят из подходящих значений (0-9)
new_number = int(number) # Преобразование строки в целое число
print(type(new_number))

divide = 7 / 3.4
print(int(divide)) # Преобразование числа с плавающей точкой в целое число

# print(int("234а"))

# float() - функция, преобразующая переданные в качестве аргумента данные в тип чисел с плавающей точкой, если они состоят из подходящих значений (0-9 и .).

# str() - функция, преобразующая переданные в качестве аргумента данные в строку.
not_string = 123
it_is_string = str(not_string)

# Программа для возведения чисел в куб. Вариант 1
number = int(input("Напиши в консоль число, а я тебе его возведу в куб!\n"))
print("Ваше кубическое число:", number ** 3)

# Программа для возведения чисел в куб. Вариант 2
number = input("Напиши в консоль число, а я тебе его возведу в куб!\n")
print("Ваше кубическое число:", int(number) ** 3)

# Перевод валюты из тенге в рубли
kzt = float(input("Введите сумму в тенге:\n"))
rub = float(input("Курс тенге к рублю:\n"))
print(kzt, "тенге —", kzt * rub, "рублей")
