# Цикл — конструкция в языке программирования, позволяющая многократно выполнить один и тот же блок команд до тех пор, пока выполняется условие или пока не будут перебраны все элементы последовательности (в зависимости от вида цикла).

# Циклы с условием
# Цикл с условием (условный цикл) — конструкция, позволяющая многократно выполнить один и тот же блок команд до тех пор, пока истинно условие (связанное условное выражение возвращает True). В теле цикла обязательно должна быть команда, изменяющее значение условного выражения, иначе такой цикл называет "бесконечным". Условие проверяется перед каждым ходом цикла (итерацией).

# while (оператор цикла с условием, ключевое слово "пока/до тех пор")

# Шаблон построения цикла с условием:
# while <условное выражение, управляющее циклом, возвращающее True или False>
#     [блок команд (тело цикла), выполняемый в том случае, если ответ был True]
#     ...

number = 10
while number != 0:
    print(number)
    number -= 1

number = int(input("Введи число больше нуля"))
while number != 0:
    print(number % 10)
    number //= 10

# В конструкции цикла с условием допустимо использование оператора else, к которому прописывается блок кода, который будет выведен в случае возврата ложного значения условного выражения при естественном завершении цикла.

# Шаблон построения цикла с условием, включающего else:
# while <условное выражение, управляющее циклом, возвращающее True или False>:
#     [блок команд (тело цикла), выполняемый в том случае, если ответ был True]
#     ...
# else:
#     [блок команд, выполняемый в том случае, если ответ был False, способен выполниться один раз]
#     ...

age = 0
while age < 18:
    age = int(input("Введите Ваш возраст: "))
    print("Доступ закрыт! Ваш возраст не соотвествует возрастному ограничению!")
else:
    print("Доступ открыт!")

# break — оператор цикла, прерывающий выполнение цикла досрочно, с выполнением дальнейших инструкций после цикла.

summ = 0
while True:
    number = input("Введи число для суммирования или 'stop' для остановки: ")
    if number == "stop":
        break
    else:
        summ += int(number)
print("Общая сумма чисел:", summ)

# continue — оператор цикла, ппозволяющий перейти к следующему ходу цикла (итерации) до завершения текущего хода цикла.

number_1 = int(input("Введите начало диапазона: "))
number_2 = int(input("Введите конец диапазона: "))
while number_1 <= number_2:
    if 0 <= number_1 < 10:
        number_1 += 1
        continue
    if number_1 % 2 == 0:
        print(number_1)
    number_1 += 1
